<!-- ************************************************************* -->
<!-- JSP 기술의 한 종류인 [Page Directive]를 이용하여 현 JSP 페이지 처리 방식 선언하기 -->
<!-- ************************************************************* -->

<!-- 현재 이 JSP 페이지 실행 후 생성되는 문서는 HTML 이고, 이 문서 안의 데이터는 UTF-8 방식으로 인코딩한다 라고 설정함  -->
<!-- 현재 이 JSP 페이지는 UTF-8 방식으로 인코딩 한다. -->
<!-- UTF-8 인코딩 방식은 한글을 포함 전 세계 모든 문자열을 부호화할 수 있는 방법이다. -->
<!-- 모든 JSP 페이지 상단에는 무조건 아래 설정이 들어간다. -->
<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>

<!-- ************************************************************* -->
<!-- 현재 JSP 페이지에서 사용할 클래스 수입하기 -->
<!-- ************************************************************* -->
<%@page import="java.util.Map"%>
<%@page import="java.util.List"%>

<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">

<!-- JQuery 삽입 -->
<script src="/resources/jquery-1.11.0.min.js" type="text/javascript"></script>

<style>

</style>

<script>

	//--------------------------------------------------------------
	// [게시판 글쓰기 화면]으로 이동하는 함수 선언
	//--------------------------------------------------------------
	function goBoardRegForm(){
		location.replace("/boardRegForm.do");
	}

	//--------------------------------------------------------------
	// [게시판 상세보기 화면]으로 이동하는 함수 선언
	//--------------------------------------------------------------
	function goBoardContentForm(b_no){

		//--------------------------------------------------------------
		// name="boardContentForm" 가진 form 태그 내부의 name="b_no" 가진
		// 입력 양식에 클릭한 행의 게시판 번호 저장하기
		//--------------------------------------------------------------
		$("[name='boardContentForm'] [name='b_no']").val(b_no); 

		//--------------------------------------------------------------
		// name="boardContentForm" 가진 form 태그 내부의 action 값의 URL 주소로 서버에 접속하기
		// 즉, 상세보기 화면으로 이동하기
		//--------------------------------------------------------------
		document.boardContentForm.submit();
		
	}

	//--------------------------------------------------------------
	// 키워드에 입력한 데이터를 가진 [게시판 목록]을 검색하여 결과를 보여주는 함수 선언
	//--------------------------------------------------------------
	function search(){
		//--------------------------------------------------------------
		// 입력한 키워드 얻어오기
		//--------------------------------------------------------------
		var keyword1 = $(".keyword1").val();

		//--------------------------------------------------------------
		// 만약 키워드가 비어있거나 공백으로 구성되어 있으면 경고 후 비우고 함수 중단하기
		//--------------------------------------------------------------
		if( keyword1 == null || keyword1.split(" ").join("") == "" ){
			alert("키워드를 입력해주세요.");
			$(".keyword1").val("");
			return;
		}

		//--------------------------------------------------------------
		// 입력한 키워드의 앞 뒤 공백 제거하고 다시 넣어주기
		//--------------------------------------------------------------
		$(".keyword1").val($.trim(keyword1));

		//--------------------------------------------------------------
		// 비동기 방식으로 웹서버에 접속하여 키워드를 만족하는 
		// 검색 결과물을 응답받아 현 화면에 반영하기
		//--------------------------------------------------------------
		searchExe();

		
	}

	//--------------------------------------------------------------
	// 모두검색 버튼을 눌렀을 경우
	//--------------------------------------------------------------
	function searchAll(){
		$(".keyword1").val("");
		searchExe();
	}

	function searchExe(){

		//--------------------------------------------------------------
		// 현재 화면에서 페이지 이동 없이(=비동기 방식으로)
		// 서버쪽 /boardList.do 로 접속하여 키워드를 만족하는
		// 검색 결과물을 응답받아 현 화면에 반영하기
		//--------------------------------------------------------------
		$.ajax({
			//--------------------------------------------------------------
			// 서버 쪽 호출 URL 주소 지정
			//--------------------------------------------------------------
			url: "/boardList.do"
			//--------------------------------------------------------------
			// form 태그 안의 입력양식 데이터 즉, 파라미터값을 보내는 방법 지정
			//--------------------------------------------------------------
			,type: "post"
			//--------------------------------------------------------------
			// 서버로 보낼 파라미터명과 파라미터값을 설정
			//--------------------------------------------------------------
			,data: $("[name='boardListForm']").serialize()
			//--------------------------------------------------------------
			// 서버의 응답을 성공적으로 받았을 경우 실행할 익명함수 설정
			// 익명함수의 매개변수에는 서버가 보내온 html 소스가 문자열로 들어온다
			// 즉, 응답메시지 안의 html 소스가 문자열로써 익명함수의 매개변수로 들어온다.
			// 응답메시지 안의 html 소스는 boardList.jsp 의 실행 결과물이다.
			//--------------------------------------------------------------
			,success: function(responseHtml){

				//--------------------------------------------------------------
				// 매개변수 responseHtml로 들어온 검색 결과물 html 소스문자열에서 
				// class="searchResult"를 가진 태그 내부의 [검색 결과물 html 소스]를 얻어서
				// 아래 현 화면의 html 소스 중에 class="searchResult" 를 가진 태그 내부에 덮어씌우기
				//--------------------------------------------------------------
				$(".searchResult").html($(responseHtml).find(".searchResult").html());

				//--------------------------------------------------------------
				// 매개변수 responseHtml로 들어온 검색 결과물 html 소스문자열에서 
				// class="boardListAllCnt"를 가진 태그 내부의 [총개수 문자열]을 얻어서
				// 아래 현 화면의 html 소스 중에 class="boardListAllCnt" 를 가진 태그 내부에 덮어씌우기
				//--------------------------------------------------------------
				$(".boardListAllCnt").html($(responseHtml).find(".boardListAllCnt").text());
				
			}
			//--------------------------------------------------------------
			// 서버의 응답을 못 받았을 경우 실행할 익명함수 설정
			//--------------------------------------------------------------
			,error: function(){
				alert("서버 접속 실패!");
			}		
		});

	}
	
</script>

</head>
<body>

<center>

	<!-- ************************************************************* -->
	<!-- [게시판 검색 조건 입력 양식] 내포한 form 태그 선언 -->
	<!-- ************************************************************* -->
	<form name="boardListForm">
		[키워드] : <input type="text" name="keyword1" class="keyword1" onKeydown="if(event.keyCode==13){search();}">
		<input type="button" value="검색" class="boardSearch" onClick="search();">&nbsp;
		<input type="button" value="모두검색" class="boardSearchAll" onClick="searchAll();">&nbsp;	
		
		<!-- 선택한 페이지 번호 저장 -->
		<input type="hidden" value="selectPageNo" class="selectPageNo" value="1">
		<!-- 한 화면에 보여줄 행의 개수 선택 -->
		<select name="rowCntPerPage" class="rowCntPerPage" onChange="search();">
			<option value="10">10</option>			
			<option value="15">15</option>			
			<option value="20">20</option>			
			<option value="25">25</option>			
			<option value="30">30</option>			
		</select> 행보기
			
		<!-- ************************************************************* -->
		<!-- href="javascript:자바스크립트코드" 클릭 시 코딩한 자바스크립트코드를 실행한다. -->
		<!-- ************************************************************* -->
		<a href="javascript:goBoardRegForm();">새글쓰기</a>
	</form>
	
	<div style="height:10px"></div>
	
	<div class="boardListAllCnt">검색 개수 : <%=(int)request.getAttribute("boardListAllCnt")%>개</div>
	<div class="searchResult">
		<table border="1">
			<tr>
				<th>번호</th>
				<th>제목</th>
				<th>작성자</th>
				<th>조회수</th>
				<th>등록일</th>
			</tr>
			
			
			<%
				List<Map<String, String>> boardList = (List<Map<String, String>>)request.getAttribute("boardList");
				
				//--------------------------------------------------------------
				// boardList가 null이 아니면
				//--------------------------------------------------------------
				if( boardList != null ) {
					
					//--------------------------------------------------------------
					// 역순번호 넣어줄 변수 선언
					//--------------------------------------------------------------
					int totCnt = boardList.size();
					
					for( int i = 0; i < boardList.size(); i++ ) {
						
						//--------------------------------------------------------------
						// boardList에서 i번째 요소 꺼내서 map에 저장하기
						//--------------------------------------------------------------
						Map<String,String> map = boardList.get(i);
						
						//--------------------------------------------------------------
						// map에서 키값에 대한 데이터 꺼내서 각 변수에 저장하기
						//--------------------------------------------------------------
						int b_no = Integer.parseInt(map.get("B_NO"), 10);
						String subject = map.get("SUBJECT");
						String writer = map.get("WRITER");
						String readcount = map.get("READCOUNT");
						String reg_date = map.get("REG_DATE");
						int print_level = Integer.parseInt(map.get("PRINT_LEVEL"), 10);
						String xxx = "";
						
						
						//--------------------------------------------------------------
						// print_level 만큼 반복문 돌려서 공백 저장해주기
						//--------------------------------------------------------------
						for(int j=0; j < print_level; j++){
							xxx += "&nbsp&nbsp&nbsp";
						}
						
						//--------------------------------------------------------------
						// "ㄴ" 추가해주기
						//--------------------------------------------------------------
						if(print_level > 0) { xxx = xxx + "ㄴ"; }
						
						//--------------------------------------------------------------
						// 출력
						//--------------------------------------------------------------
						out.println( "<tr style='cursor:pointer' onClick='goBoardContentForm("+b_no+")'><td>"+(totCnt--)+"<td>"+xxx+subject
								+"<td>"+writer+"<td>"+readcount+"<td>"+reg_date );
						
					}
				}
			%>
			
			
		</table> 
	</div>
	
	<!-- ************************************************************* -->
	<!-- 게시판 상세 보기 화면으로 이동하는 form 태그 선언하기 -->
	<!-- form 태그 안에 action 값이 있다면 페이지 이동하겠다는 말이다. -->
	<!-- ************************************************************* -->
	<form name="boardContentForm" method="post" action="/boardContentForm.do">
		<!-- ************************************************************* -->
		<!-- [클릭한 게시판 글의 고유번호]가 저장되는 [hidden 입력 양식] 선언 -->
		<!-- hidden 태그에 어떤 값이 들었는지 모르니까 개발하는 동안 type="text"로 변경하여 편함! -->
		<!-- ************************************************************* -->
		<input type="hidden" name="b_no">
	</form>
		
</center>


</body>
</html>